Пансион83/src/Catalogs/ПакетыУслуг/ПакетыУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПакетыУслуг</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Remarks</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>SortCode</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DateValidFrom</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DateValidTo</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IdentificationCardType</name>
    <type>
      <types>CatalogRef.ТипКартИД</types>
    </type>
  </attributes>
  <attributes>
    <name>Гостиница</name>
    <type>
      <types>CatalogRef.Гостиницы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Services</name>
    <attributes>
      <name>Period</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ClientType</name>
      <type>
        <types>CatalogRef.ТипыКлиентов</types>
      </type>
    </attributes>
    <attributes>
      <name>AccommodationType</name>
      <type>
        <types>CatalogRef.ВидыРазмещения</types>
      </type>
    </attributes>
    <attributes>
      <name>Service</name>
      <type>
        <types>CatalogRef.Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Currency</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>7</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Unit</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>CatalogRef.СтавкаНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Remarks</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>IsInPrice</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>IsServicePerPerson</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityCalculationRule</name>
      <type>
        <types>CatalogRef.ПравилаНачисленияКоличестваУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>CalendarDayType</name>
      <type>
        <types>CatalogRef.ТипДневногоКалендаря</types>
      </type>
    </attributes>
    <attributes>
      <name>AccountingDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AccountingDayNumber</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Пансион83/src/InformationRegisters/ЗапПакУслуг/ЗапПакУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗапПакУслуг</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Price</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Quantity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Unit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>VATRate</name>
    <type>
      <types>CatalogRef.СтавкаНДС</types>
    </type>
  </resources>
  <resources>
    <name>Remarks</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>IsInPrice</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>IsServicePerPerson</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>RowNumber</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ServicePackage</name>
    <type>
      <types>CatalogRef.ПакетыУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ClientType</name>
    <type>
      <types>CatalogRef.ТипыКлиентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Service</name>
    <type>
      <types>CatalogRef.Услуги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AccommodationType</name>
    <type>
      <types>CatalogRef.ВидыРазмещения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>QuantityCalculationRule</name>
    <type>
      <types>CatalogRef.ПравилаНачисленияКоличестваУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CalendarDayType</name>
    <type>
      <types>CatalogRef.ТипДневногоКалендаря</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AccountingDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>AccountingDayNumber</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Пансион83/src/Catalogs/ПакетыУслуг/ObjectModule.bsl
//-----------------------------------------------------------------------------
Процедура BeforeWrite(pCancel)
	For Each vSrvRow In Services Do
		If НЕ ЗначениеЗаполнено(vSrvRow.Period) Тогда
			vSrvRow.Period = '20000101';
		EndIf;
	EndDo;
КонецПроцедуры //BeforeWrite

//-----------------------------------------------------------------------------
// Write to the service package records register
//-----------------------------------------------------------------------------
Процедура OnWrite(pCancel)
	vRcdSet = InformationRegisters.ЗапПакУслуг.CreateRecordSet();
	vServicePackageFlt = vRcdSet.Filter.ServicePackage;
	vServicePackageFlt.ComparisonType = ComparisonType.Equal;
	vServicePackageFlt.Value = Ref;
	vServicePackageFlt.Use = True;
	For Each vSrvRow In Services Do
		vRcdSetRow = vRcdSet.Add();
		vRcdSetRow.ServicePackage = Ref;
		FillPropertyValues(vRcdSetRow, vSrvRow);
		vRcdSetRow.RowNumber = vSrvRow.LineNumber;
	EndDo;
	vRcdSet.Write(True);
КонецПроцедуры //OnWrite

//-----------------------------------------------------------------------------
// Write to the service package records register
//-----------------------------------------------------------------------------
Function pmGetServices(pDate) Экспорт
	vQry = New Query();
	vQry.Text =
	"SELECT
	|	ServicePackageRecordsSliceLast.ServicePackage,
	|	ServicePackageRecordsSliceLast.ТипКлиента,
	|	ServicePackageRecordsSliceLast.Услуга,
	|	ServicePackageRecordsSliceLast.ВидРазмещения,
	|	ServicePackageRecordsSliceLast.QuantityCalculationRule,
	|	ServicePackageRecordsSliceLast.ТипДеньКалендарь,
	|	ServicePackageRecordsSliceLast.УчетнаяДата,
	|	ServicePackageRecordsSliceLast.AccountingDayNumber,
	|	ServicePackageRecordsSliceLast.Цена,
	|	ServicePackageRecordsSliceLast.Валюта,
	|	ServicePackageRecordsSliceLast.Количество,
	|	ServicePackageRecordsSliceLast.ЕдИзмерения,
	|	ServicePackageRecordsSliceLast.СтавкаНДС,
	|	ServicePackageRecordsSliceLast.Примечания,
	|	ServicePackageRecordsSliceLast.IsInPrice,
	|	ServicePackageRecordsSliceLast.IsServicePerPerson,
	|	ServicePackageRecordsSliceLast.RowNumber
	|FROM
	|	InformationRegister.ServicePackageRecords.SliceLast(&qDate, ServicePackage = &qServicePackage) AS ServicePackageRecordsSliceLast
	|
	|ORDER BY
	|	ServicePackageRecordsSliceLast.RowNumber";
	vQry.SetParameter("qServicePackage", Ref);
	vQry.SetParameter("qDate", pDate);
	vServices = vQry.Execute().Unload();
	Return vServices;
EndFunction //pmGetServices
